Autodesk.Revit.DB.Edge.ComputeDerivatives(System.Double)
Returns the vectors describing the edge at the specified parameter.
parameter: The parameter to be evaluated.
Returns: The transformation containing a tangent vector, derivative of tangent vector, and bi-normal vector.
Remarks:
The following is the meaning of the transformation members:
Origin is the point on the edge (equivalent to Evaluate);BasisX is the tangent vector (the first derivative);BasisY is the second derivative;BasisZ is the bi-normal vector (tangent x normal).Normal and bi-normal are zero if the edge is straight at the point.
None of the vectors are normalized.

Autodesk.Revit.DB.Edge.ApproximateLength
Returns the approximate length of the edge.
Remarks:
Estimates the length of the edge by adding together tessellated segments,
Will underestimate when the surface is curved.

Autodesk.Revit.DB.Edge.GetEndPointReference(System.Int32)
Returns a stable reference to the start or the end point of the edge.
index: Use 0 for the start point; 1 for the end point.
Returns: Reference to the point or null if reference cannot be obtained.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the specified index is not 0 or 1.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the object is internally marked as read-only in the setter.

Autodesk.Revit.DB.Edge.Reference
Returns a stable reference to the edge.
Remarks: This value is  if the corresponding geometry object does not permit referencing.

Autodesk.Revit.DB.Edge.AsCurveFollowingFace(Autodesk.Revit.DB.Face)
Returns a curve that corresponds to this edge as oriented in its topological direction on the specified face.
faceForDir: Specifies the face, on which the curve will follow the topological direction of the edge.
Remarks: Evaluating the edge using EvaluateOnFace gives the same result as evaluating the curve returned by AsCurveFollowingFace with a normalized
curve parameter. When a Hermite spline is returned, the two evaluated points will be approximately equal.
Returns: It can be an Arc, Line, or HermiteSpline.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the specified faceForDir is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the specified faceForDir is not one of the faces for this edge.

Autodesk.Revit.DB.Edge.AsCurve
Returns a curve that corresponds to the edge's parametric orientation.
Returns: It can be an Arc, Line, or HermiteSpline.

Autodesk.Revit.DB.Edge.EvaluateOnFace(System.Double,Autodesk.Revit.DB.Face)
Evaluates a parameter on the edge to produce UV coordinates on the face.
param: The parameter to be evaluated, in [0,1].
face: The face on which to perform the evaluation. Must belong to the edge.

Autodesk.Revit.DB.Edge.Evaluate(System.Double)
Evaluates a parameter on the edge.
param: The parameter to be evaluated, in [0,1].

Autodesk.Revit.DB.Edge.TessellateOnFace(Autodesk.Revit.DB.Face)
Returns a polyline approximation to the edge in UV parameters of the face.
face: The face on which to perform the tessellation. Must belong to the edge.
Remarks: Tolerance of approximation is defined internally by Revit to be adequate for
display purposes.

Autodesk.Revit.DB.Edge.Tessellate
Returns a polyline approximation to the edge.
Remarks: Tolerance of approximation is defined internally by Revit to be adequate for
display purposes.

Autodesk.Revit.DB.Edge.GetFace(System.Int32)
Returns one of the two faces that meet at the edge.
index: The index of the face (0 or 1).
Since: 2014

Autodesk.Revit.DB.Edge
An edge of a 3d solid.
Remarks: Edges are defined by intersections of surfaces that form faces of the solid.
They have arbitrary parameterization that is normalized to [0,1].